/*
1. сделать шаблонную функцию для работы с числовыми данными (пара чисел и массив чисел) 
    и специальную функцию для работы со строками делая произведение чисел (одинаковые символы в обеих строках)
2. Сделать шаблон класса "массив" для работы с одномерым динамическим массивом и провенрить его работу на массивах разгого типа.
    -КОнструктор
    -Деструктор
    -Нахождение суммы элементов
    -Максимума
    -Минимума
    -Сортировки
    -Среднего
*/

#include <iostream>
#include <string>
#include "Array2D.hpp"

using namespace std;



int main(int argc, char const *argv[])
{
    return EXIT_SUCCESS;
}

